src/Documents/СправкаВНалоговую.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СправкаВНалоговую</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Прием</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/СправкаВНалоговую/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Пациент", КонтрагентОтбор, ЗначениеЗаполнено(КонтрагентОтбор));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "СправкаВНалоговую");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.СправкаВНалоговую.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти
